# Урок 2 Pandas

# Задание 1

In [3]:
import pandas as pd

In [4]:
import numpy as np

In [6]:
a = {
    "author_id": [1,2,3],
    "author_name": ['Тургенев', 'Чехов', 'Островский']
}

In [8]:
authors  = pd.DataFrame(a)
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [10]:
b = {
    "author_id": [1, 1, 1, 2, 2, 3, 3],
    "book_title ": ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    "price": [450, 300, 350, 500, 450, 370, 290]
}
book = pd.DataFrame(b)
book

   author_id           book_title   price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

# Задание 2

In [40]:
authors_price =  pd.merge(authors, book, on='author_id', how='right')
authors_price

   author_id author_name           book_title   price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

# Задание 3

In [51]:
top5=authors_price.nlargest(5, "price")

top5.reset_index(drop=True, inplace=True)

top5

   author_id author_name        book_title   price
0          2       Чехов   Толстый и тонкий    500
1          1    Тургенев        Отцы и дети    450
2          2       Чехов    Дама с собачкой    450
3          3  Островский              Гроза    370
4          1    Тургенев  Дворянское гнездо    350

# Задание 4

In [80]:
authors_stat = pd.merge(authors_price.groupby("author_name").agg({"price": "max"}), authors_price.groupby("author_name").agg({"price": "min"}), on="author_name", how='inner')
authors_stat = pd.merge(authors_stat, authors_price.groupby("author_name").agg({"price": "sum"}), on="author_name", how='inner')
authors_stat.rename({'price_x': 'max_price', 'price_y': 'min_price', 'price': 'mean_price'}, axis=1, inplace=True)
authors_stat

             max_price  min_price  mean_price
author_name
Островский         370        290         660
Тургенев           450        300        1100
Чехов              500        450         950

#  Задание 5

In [81]:
authors_price["cover"]=['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price

   author_id author_name           book_title   price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [89]:
book_info = authors_price.pivot_table('price', index='author_name', columns='cover', aggfunc='sum')

book_info["мягкая"].fillna(0, inplace=True)
book_info["твердая"].fillna(0, inplace=True)

book_info

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

In [90]:
book_info.to_pickle("book_info.pkl")

book_info2 = pd.read_pickle("book_info.pkl")

book_info, book_info2

(cover        мягкая  твердая
 author_name
 Островский    660.0      0.0
 Тургенев      650.0    450.0
 Чехов           0.0    950.0,
 cover        мягкая  твердая
 author_name
 Островский    660.0      0.0
 Тургенев      650.0    450.0
 Чехов           0.0    950.0)